Revit 2027 API
UnitTypeId.Meganewtons Property
 Meganewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Meganewtons { get; }
Public Shared ReadOnly Property Meganewtons As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Meganewtons {
	ForgeTypeId^ get ();
}
static member Meganewtons : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace